"""
Дан отсортированный массив, содержащий N элементов. Элементы массива пронумерованы от 0 до N - 1.
Требуется ответить на M запросов вида «найти индекс последнего вхождения числа X в массив».

Формат ввода
Первая строка содержит целое число N (1 ≤ N ≤ 105) — количество элементов в массиве.
Вторая строка содержит N целых чисел Ai (-231 ≤ Ai ≤ 231 - 1) — элементы массива.
Третья строка содержит целое число M (1 ≤ M ≤ 105) — количество запросов.
Четвёртая строка содержит M целых чисел Xi (-231 ≤ Xi ≤ 231 - 1) — искомые элементы для каждого запроса.

Формат вывода
Выведите одно целое число — сумму ответов на все M запросов.
Ответом на i-й запрос является индекс последнего вхождения числа Xi в массив, либо -1, если число Xi не содержится в массиве.
"""



n = int(input())
a = list(map(int, input().split()))
m = int(input())
xlist = list(map(int, input().split()))
ans = 0
for x in xlist:
    left = -1
    right = len(a)
    while right - left > 1:
        pivot = (right + left) // 2
        if a[pivot] <= x:
            left = pivot
        else:
            right = pivot
    if a[left] == x:
        ans += left
    else:
        ans -= 1
print(ans)
