"""
Дан массив, элементами которого являются целые числа. Требуется вывести состояние этого массива после заданного количества шагов сортировки вставками.

Формат ввода
Первая строка содержит целое число N (2 ≤ N ≤ 1000) — количество элементов массива.
Вторая строка содержит N целых чисел Ai (-231 ≤ Ai ≤ 231 - 1) — элементы массива.
Третья строка содержит целое число K (1 ≤ K < N).

Формат вывода
Выведите N целых чисел — элементы массива в том порядке, в котором они находятся сразу после завершения K-й итерации внешнего цикла сортировки вставками (см. примеры). 
"""



def insertion(lens, s, k):
    lp = 0
    for i in range(lens):
        j = i - 1
        key = s[i]
        while s[j] > key and j >= 0:
            s[j + 1] = s[j]
            j -= 1
        s[j + 1] = key
        lp += 1
        if lp == k + 1:
            return s
    return s


print(*insertion(int(input()), list(map(int, input().split())), int(input())))
