"""
Дано арифметическое выражение, записанное в постфиксной нотации. Выражение может содержать неотрицательные вещественные числа, заданные с двумя знаками после десятичной точки, и операции +, -, *, /.
Требуется найти значение этого выражения, учитывая следующие правила:
    Если результат операции оказывается больше 106 (или производится деление положительного числа на ноль), он заменяется на 106;
    Если результат операции оказывается меньше -106 (или производится деление отрицательного числа на ноль), он заменяется на -106;
    Если результат операции по абсолютной величине оказывается меньше 10-6, он заменяется на 0.

Формат ввода
Ввод содержит строку S (1 ≤ |S| ≤ 2000) — запись арифметического выражения. Гарантируется, что запись корректна.

Формат вывода
Выведите одно вещественное число — значение выражения. Точность ответа должна составлять не менее 4 знаков после десятичной точки.
"""



def post(expr):
    stack = []
    for a in expr.split():
        if (a == '+'):
            a2 = stack[0]
            a1 = stack[1]
            r = a1 + a2
            if r > 1000000:
                r = 1000000
            elif r < -1000000:
                r = -1000000
            stack = [r] + stack[2:]
        elif (a == '-'):
            a2 = stack[0]
            a1 = stack[1]
            r = a1 - a2
            if r > 1000000:
                r = 1000000
            elif r < -1000000:
                r = -1000000
            stack = [r] + stack[2:]
        elif (a == '*'):
            a2 = stack[0]
            a1 = stack[1]
            r = a1 * a2
            if r > 1000000:
                r = 1000000
            elif r < -1000000:
                r = -1000000
            stack = [r] + stack[2:]
        elif (a == '/'):
            a2 = stack[0]
            a1 = stack[1]
            if a2 == 0 and a1 >= 0:
                r = 1000000
            elif a2 == 0 and a1 <= 0:
                r = -1000000
            elif a2 != 0:
                r = a1 / a2

            if r > 1000000:
                r = 1000000
            elif r < -1000000:
                r = -1000000
            stack = [r] + stack[2:]
        else:
            stack = [float(a)] + stack
    return stack[0]


print(post(input()))
