"""
Напишите программу, которая считывает целое число и выводит текст, аналогичный приведенному в примере (пробелы важны!). Нельзя пользоваться конкатенацией строк.

Формат ввода
Вводится целое число (гарантируется, что число находится в диапазоне от -1000 до +1000).

Формат вывода
Выведите две строки, согласно образцу.
"""



n = int(input())
n_next = n+1
n_prew = n-1
print("The next number for the number ", n, " is ", n_next, ".", sep="")
print("The previous number for the number ", n, " is ", n_prew, ".", sep="")
