"""
Улитка ползет по вертикальному шесту высотой H метров, поднимаясь за день на A метров, а за ночь спускаясь на B метров. На какой день улитка доползет до вершины шеста?

Формат ввода
Программа получает на вход натуральные числа H, A, B. Гарантируется, что A > B, A < H.

Формат вывода
Программа должна вывести одно натуральное число.
"""



h = float(input())
a = float(input())
b = float(input())
print(int(1 + (h - b - 1) / (a - b)))
