"""
Дано четырехзначное число. Определите, является ли его десятичная запись симметричной. Если число симметричное, то выведите 1, иначе выведите любое другое целое число. Число может иметь меньше четырех знаков, тогда нужно считать, что его десятичная запись дополняется слева незначащими нулями.

Формат ввода
Вводится единственное число.

Формат вывода
Выведите ответ на задачу.
"""



a = int(input())
print(((a // 10) % 10) + (a % 10) * 10 - a // 100 + 1)
