"""
Рассмотрим карту, левый нижний угол которой имеет координаты (0; 0), а правый верхний — (1; 1).
Область, ограниченная точками (0; 0), (0; Y), (1; Y), (1; 0), занята лесом.
Область, ограниченная точками (0; Y), (0; 1), (1; 1), (1; Y), занята полем.
Скорость передвижения по лесу равна V1, скорость перемещения по полю равна V2. Определите, в какой точке нужно пересечь границу леса и поля, чтобы как можно быстрее добраться из точки (0; 0) в точку (1; 1).

Формат ввода
Ввод содержит вещественные числа Y, V1 и V2 (0 < Y, V1, V2 < 1) — соответственно координату прямой, разделяющей лес и поле, скорость передвижения по лесу и скорость передвижения по полю. Все числа даны с четырьмя знаками после запятой.

Формат вывода
Выведите одно вещественное число — координату X точки, в которой нужно пересечь границу леса и поля, чтобы путь из одного угла карты в другой занял минимальное время. Точность ответа должна составлять не менее 6 знаков после запятой. 
"""


import math


def f(xa, ya, vles, vpole):
    return math.sqrt(xa ** 2 + ya ** 2) * vpole + \
           math.sqrt((1 - xa) ** 2 + (1 - ya) ** 2) * vles


y, v1, v2 = list(map(float, input().split()))
left = 0.0
right = 1.0
k = 0
while right - left > 0.000000001:
    m1 = left + (right - left) / 3
    m2 = right - (right - left) / 3
    k += 1
    if f(m1, y, v1, v2) < f(m2, y, v1, v2):
        right = m2
    else:
        left = m1
print(right)
