"""
Дано натуральное число. Выведите его последнюю цифру.

Формат ввода
Вводится единственное целое неотрицательное число (гарантируется, что оно не превышает 10000).

Формат вывода
Выведите ответ на задачу.
"""



n = int(input())
print(n % 10)

