"""
За день машина проезжает N километров. Сколько дней нужно, чтобы проехать маршут длиной M километров?

Формат ввода
Программа получает на вход числа N и M (целые, положительные).

Формат вывода
Выведите ответ на задачу.
"""



n, m = int(input()), int(input())
print(int((m - 1 + n) / n))
