___
# A
Шахматный ферзь ходит по диагонали, горизонтали или вертикали. Даны две различные клетки шахматной доски. Определите, может ли ферзь попасть с первой клетки на вторую одним ходом.

**Формат ввода**

Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки.

**Формат вывода**

Программа должна вывести YES, если из первой клетки ходом ферзя можно попасть во вторую, или NO в противном случае.

```c++
#include <iostream>

int main() {
    int x1, y1, x2, y2;
    std::cin >> x1 >> y1 >> x2 >> y2;
    if (abs(x2 - x1) == abs(y2 - y1) || x1 == x2 || y1 == y2) {
        std::cout << "YES\n";
    } else {
        std::cout << "NO\n";
    }
    return 0;
}
```

___
# B
По номеру дня недели (нумерация с единицы) выведите его сокращенное название. Названия должны быть такими:
mon
tue
wed
thu
fri
sat
sun

**Формат ввода**

Число от 1 до 7.

**Формат вывода**

Название дня недели из трех маленьких латинских букв.

```c++
#include <iostream>

int main() {
    int day;
    std::cin >> day;
    if (day == 1) {
        std::cout << "mon\n";
    } else if (day == 2) {
        std::cout << "tue\n";
    } else if (day == 3) {
        std::cout << "wed\n";
    } else if (day == 4) {
        std::cout << "thu\n";
    } else if (day == 5) {
        std::cout << "fri\n";
    } else if (day == 6) {
        std::cout << "sat\n";
    } else if (day == 7) {
        std::cout << "sun\n";
    }
    return 0;
}

```

___
# C
Вам требуется вычислить сумму цифр целого неотрицательного числа.

**Формат ввода**

Единственная строка входного файла содержит ровно одно целое число n, 0 ≤ n ≤ 109.

**Формат вывода**

Выведите сумму цифр этого числа.

```c++
#include <iostream>

int main() {
    int n;
    int sum = 0;

    std::cin >> n;

    while (n != 0) {
        sum += n % 10;
        n /= 10;
    }
    std::cout << sum << std::endl;

    return 0;
}

```

___
# D
Шахматный ферзь ходит по диагонали, горизонтали или вертикали. Даны две различные клетки шахматной доски. Определите, может ли ферзь попасть с первой клетки на вторую одним ходом.

**Формат ввода**

Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки.

**Формат вывода**

Программа должна вывести YES, если из первой клетки ходом ферзя можно попасть во вторую, или NO в противном случае.

```c++
#include <iostream>

int main() {
    int x1, y1, x2, y2;
    std::cin >> x1 >> y1 >> x2 >> y2;
    if (abs(x2 - x1) == abs(y2 - y1) || x1 == x2 || y1 == y2) {
        std::cout << "YES\n";
    } else {
        std::cout << "NO\n";
    }
    return 0;
}
```

___
# E
Шахматный ферзь ходит по диагонали, горизонтали или вертикали. Даны две различные клетки шахматной доски. Определите, может ли ферзь попасть с первой клетки на вторую одним ходом.

**Формат ввода**

Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки.

**Формат вывода**

Программа должна вывести YES, если из первой клетки ходом ферзя можно попасть во вторую, или NO в противном случае.

```c++
#include <iostream>

int main() {
    int x1, y1, x2, y2;
    std::cin >> x1 >> y1 >> x2 >> y2;
    if (abs(x2 - x1) == abs(y2 - y1) || x1 == x2 || y1 == y2) {
        std::cout << "YES\n";
    } else {
        std::cout << "NO\n";
    }
    return 0;
}
```

___
# F
Шахматный ферзь ходит по диагонали, горизонтали или вертикали. Даны две различные клетки шахматной доски. Определите, может ли ферзь попасть с первой клетки на вторую одним ходом.

**Формат ввода**

Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки.

**Формат вывода**

Программа должна вывести YES, если из первой клетки ходом ферзя можно попасть во вторую, или NO в противном случае.

```c++
#include <iostream>

int main() {
    int x1, y1, x2, y2;
    std::cin >> x1 >> y1 >> x2 >> y2;
    if (abs(x2 - x1) == abs(y2 - y1) || x1 == x2 || y1 == y2) {
        std::cout << "YES\n";
    } else {
        std::cout << "NO\n";
    }
    return 0;
}
```
