"""
Дан массив, элементами которого являются целые числа.
Требуется отсортировать его по неубыванию.
Затем требуется отсортировать его по невозрастанию количества единиц в двоичной записи элемента (элементы с одинаковым количеством единиц должны быть отсортированы по неубыванию).

Формат ввода
Первая строка содержит целое число N (1 ≤ N ≤ 105) — количество элементов массива.
Вторая строка содержит N целых чисел Ai (0 ≤ Ai ≤ 231 - 1) — элементы массива.

Формат вывода
В первой строке выведите N целых чисел — элементы массива в неубывающем порядке.
Во первой строке выведите N целых чисел — элементы массива в порядке невозрастания числа единиц в двоичной записи.
"""



n = int(input())
listiq = list(map(int, input().split()))
print(*sorted(listiq))
for i in range(n):
    listiq[i] = [listiq[i], str(bin(listiq[i])).count('1')]
k = sorted(listiq, key=lambda x: (-x[1], x[0]))

for i in range(len(k)):
    print(k[i][0], end=' ')
