### Условие

Будильник в сотовом телефоне можно настроить так, чтобы он звонил каждый день в одно и то же время, либо в указанное время в определенный день недели. Независимо можно настроить несколько будильников. По информации о будильниках и текущему времени и дню недели определите, когда прозвонит очередной будильник.
Формат ввода

В первой строке вводятся три числа, задающие текущее время: день недели (от 1 до 7), часы и минуты. Во второй строке вводится одно натуральное число N, не превосходящее 100 – количество будильников. В следующих N строках вводятся описания N будильников. Описание каждого будильника состоит из трех чисел: дня недели (число от 1 до 7 для понедельника,  …, воскресенья, соответственно, 0 – если будильник должен звонить каждый день), часов (от 0 до 23), минут (от 0 до 59).
Формат вывода

Выведите  через пробел три числа, задающие день недели, часы и минуты, когда прозвонит ближайший будильник. 
### Решение

```cpp
#include <iostream>
#include <math.h>

int main() {
    int d, h, m, n;
    int ans_day = 0;
    int ans_hour = 0;
    int ans_min = 0;
    int x1, x;
    x = 1000000000;
    std::cin >> d >> h >> m;
    std::cin >> n;
    int now = (d - 1) * 24 * 60 + h * 60 + m;
    for (int i = 1; i <= n; i = i + 1) {
        int b_d, b_h, b_m, time;
        std::cin >> b_d >> b_h >> b_m;
        if (b_d != 0) {
            time = (b_d - 1) * 24 * 60 + b_h * 60 + b_m;
            if (time >= now) {
                x1 = time;
            } else {
                x1 = time + 10080;
            }
        } else {
            time = b_h * 60 + b_m;
            if (h * 60 + m > b_h * 60 + b_m) {
                b_d = d + 1;
                if (b_d == 8) {
                    b_d = 1;
                }
            } else {
                b_d = d;
            }
            x1 = (b_d - 1) * 24 * 60 + b_h * 60 + b_m;
        }
        if (x1 <= x) {
            x = x1;
            ans_day = b_d;
            ans_hour = b_h;
            ans_min = b_m;
        }
    }
    std::cout << ans_day << ' ' << ans_hour << ' ' << ans_min;
    return 0;
}
```

