### Условие

Пусть на множестве A введена бинарная операция *, то есть, каждой упорядоченной паре элементов x, y ∈ A сопоставлен элемент x * y ∈ A.
Такая операция называется ассоциативной, если (x * y) * z = x * (y * z) для любых элементов x, y, z ∈ A.
Примеры ассоциативных операций - сложение или умножение обычных чисел (в школе это называли сочетательным законом), или композиция функций. Примеры неассоцитивных операций - вычитание, деление, возведение в степень. Математики называют множество с ассоциативной операцией полугруппой.
Вам нужно проверить, является ли заданная операция на n-элементном множестве A ассоциативной. Будем считать, что элементы множества A пронумерованы числами от 0 до n-1: A = {a0, …,   an-1}.
Формат ввода
В первой строке указано натуральное число n, не превосходящее 100.
Далее следует n2 чисел (каждое в пределах от 0 до n-1), которые построчно задают матрицу операции *. Это значит, что на пересечении i-й строки и j-го столбца этой матрицы стоит номер элемента ai * aj (нумерация ведётся с нуля).
Формат вывода
Выведите YES, если операция ассоциативна, и NO в противном случае.
### Решение
```cpp
#include <iostream>
#include "vector"

bool Check(std::vector<std::vector<int>> mat) {
    for (long unsigned int i = 0; i < mat.size(); i++) {
        for (long unsigned int j = 0; j < mat.size(); j++) {
            for (long unsigned int k = 0; k < mat.size(); k++) {
                // (i * j) * k != i * (j * k)
                if (mat[mat[i][j]][k] != mat[i][mat[j][k]])
                    return false;
            }
        }
    }
    return true;
}

int main() {
    std::vector<std::vector<int>> mat;
    std::vector<int> vec;
    int n;
    std::cin >> n;
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            int el;
            std::cin >> el;
            vec.push_back(el);
        }
        mat.push_back(vec);
        vec = {};
    }
    if (Check(mat))
        std::cout << "YES";
    else
        std::cout << "NO";
    return 0;
}

```
