### Условие

Вам необходимо построить поле для игры "Сапер" по его конфигурации – размерам и координатам расставленных на нем мин.

Вкратце напомним правила построения поля для игры "Сапер":

    Поле состоит из клеток с минами и пустых клеток
    Клетки с миной обозначаются символом *
    Пустые клетки содержат число ki,j от 0 до 8 – количество мин на соседних клетках. Соседними клетками являются восемь клеток, имеющих смежный угол или сторону.

Формат ввода

В первой строке содержатся три числа: M от 1 до 100 - количество строк на поле, N от 1 до 100 - количество столбцов на поле, K от 0 до MN - количество мин на поле.

В следующих K строках содержатся по два числа с координатами мин: p от 1 до M - номер строки мины, q от 1 до N - номер столбца мины.

Формат вывода

Выведите построенное поле, разделяя строки поля переводом строки, а столбцы - пробелом.
### Решение

```cpp
#include <iostream>
#include <vector>

int main() {
    int n, m, k;
    std::cin >> n >> m >> k;
    int q = 0;
    int x, y;
    std::vector<std::vector<char>> sapp;
    std::vector<char> ol;
    for (int i = 0; i < n; i ++) {
        for (int j = 0; j < m; j++) {
            ol.push_back('0');
        }
        sapp.push_back(ol);
        ol = {};
    }
    for (int i = 0; i < k; i ++) {
        std::cin >> x;
        std::cin >> y;
        sapp[x - 1][y - 1] = '*';
    }

    for (int i = 0; i < n; i ++) {
        for (int j = 0; j < m; j++) {
            if (sapp[i][j] != '*') {
                if ((i - 1 >= 0) && (j - 1 >= 0)) {
                    if (sapp[i - 1][j - 1] == '*')
                        q += 1;
                }
                if ((i - 1 >= 0)) {
                    if (sapp[i - 1][j] == '*')
                        q += 1;
                }
                if ((i - 1 >= 0) && (j + 1 < m)) {
                    if (sapp[i - 1][j + 1] == '*')
                        q += 1;
                }
                if ((j - 1 >= 0)) {
                    if (sapp[i][j - 1] == '*')
                        q += 1;
                }
                if ((j + 1 < m)) {
                    if (sapp[i][j + 1] == '*')
                        q += 1;
                }
                if ((n > i + 1) && (j - 1 >= 0)) {
                    if (sapp[i + 1][j - 1] == '*')
                        q += 1;
                }
                if ((n > i + 1)) {
                    if (sapp[i + 1][j] == '*')
                        q += 1;
                }
                if ((n > i + 1) && (m > j + 1)) {
                    if (sapp[i + 1][j + 1] == '*')
                        q += 1;
                }
                sapp[i][j] = static_cast<char>(q + 48);
                q = 0;
            }
            if (j != m-1) {
                std::cout << sapp[i][j] << ' ';
            } else {
                std::cout << sapp[i][j];
            }
        }
        std::cout << "\n";
    }
    return 0;
}
```

